from enum import StrEnum


class Texts(StrEnum):
    START = (
        "درود عزیز، من فحش‌گیر هستم، ربات اوپن‌سورس و کاملاً رایگان برای تشخیص ناسزاها در گروه‌های تلگرامی.\n\n"
        "در صورت مشاهده‌ی هرگونه حرف زشت، بات پیام رو حذف می‌کنه و اگر فرستنده ادمین نباشه، به مدت ۵ دقیقه میوت میشه.\n\n"
        "برای استفاده فقط کافیه ربات رو به گروه اضافه کرده و دسترسی کامل بدید.\n\n"
        "دستور مشاهده‌ی دیتابیس:\n"
        "<code>/db</code>\n"
        "اضافه کردن یک کلمه‌ جدید به دیتابیس\n"
        "<code>/add کلمه</code>\n"
        "حذف یک کلمه‌ی اشتباه از دیتابیس\n"
        "<code>/del کلمه</code>\n"
    )

    CHECK_FAILED = "لطفاً در کنار دستور، کلمه مورد نظر خود را هم بنویسید.\nمثال: <code>{command} اسکول</code>"

    CHECK_SUCCESS = "ممنون بابت ارسال! کلمه ارسال‌شده بررسی خواهد شد."
